lib/tasks/month_mail.rake

  task :task_model => :environment do
      @users = User.where({open_time: (Time.now.next_month.beginning_of_month)..Time.now.next_month.end_of_month})

    @users.each do |user|
---
SELECT "users".* FROM "users" WHERE "users"."open_time" BETWEEN ? AND ?  [["open_time", "2019-06-30 15:00:00"], ["open_time", "2019-07-31 14:59:59.999999"]]