app/controllers/people_controller.rb

SELECT "people".* FROM "people"
---
  def index
    @peoples = People.all

INSERT INTO "people" ("name", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4)  [["name", "Joao"], ["city", "Maria"], ["created_at", "2019-06-21"], ["updated_at", "2019-06-21"]]
---
  def create
    @people = People.new(
      name: params[:name],
      city:  params[:city]
    )

    # respond_to do |format|
      if @people.save