app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."open_time" BETWEEN ? AND ?  [["open_time", "2019-06-30 15:00:00"], ["open_time", "2019-07-31 14:59:59.999999"]]
---
  def index
    @users = User.all
    @monkeys = User.where({open_time: (Time.now.next_month.beginning_of_month)..Time.now.next_month.end_of_month})

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "open_time") VALUES (?, ?, ?, ?, ?)  [["name", "Bruno"], ["email", "dsadsd"], ["created_at", "2019-06-05 07:44:31.323231"], ["updated_at", "2019-06-05 07:44:31.323231"], ["open_time", "2019-07-12 00:00:00"]]
---
  def create
    @user = User.new(user_params)

    # respond_to do |format|
      if @user.save